;*******************************************************************************
;LABORATORY EXERCISE 3.1
;FILE LAB3_1.ASM
;*******************************************************************************
LXI H,2370H	;οι ΗL δείχνουν στην διεύθυνση μνήμης 2370Η
LXI D,2470H	;οι DE δείχνουν στην διεύθυνση μνήμης 2470Η
MVI A,00H	;Αρχικοποίηση του A στο 0 για χρήση του ως μετρητή.
TEST1:	MOV B,M	;μεταφορά του περιεχομένου μνήμης που δείχνουν οι HL στον B
XCHG
MOV M,B		;μεταφορά περιεχομένου B στη διεύθυνση μνήμης που δείχνουν οι HL.
XCHG		;ανταλλαγή των H και L με D και E
INX H		;αύξηση του ζεύγους καταχωρητών HL.
INX D		;αύξηση του ζεύγους καταχωρητών DE.
INR A		;αύξηση του μετρητή
CPI 0DH		;σύγκριση μετρητή (Α) με το πλήθος των επαναλήψεων
JNZ TEST1	;τέλος βρόχου
HLT