;*******************************************************************************
;LABORATORY EXERCISE 3.2
;FILE LAB3_2.ASM
;*******************************************************************************
LDA 2320H	
LXI H,2321H	;άμεση φόρτωση του 2321Η στον Η,L
CMP M		;Σύγκρισή του Α με ότι περιέχει η μνήμη που δείχνει ο Η,L 
JZ LABEL1	;σε ισότητα το Zero flag γίνετε 1. Μεταφορά στην LABEL1
JC LABEL2 	;διακλάδωση στην LABEL2 όταν ο αριθμός στην 2321H είναι μεγαλύτερος
STA 2322H	;αποθήκευση του Α στην διεύθυνση μνήμης 2322Η 
MOV A,M	;μεταφορά δεδομένου από την [Η,L] μνήμη στον Α
STA 2323H	;αποθήκευση του Α στην διεύθυνση μνήμης 2323Η 
JMP LABELEND 	;διακλάδωση στο LABEL_END
LABEL1:	STA 2323H	;αποθήκευση του Α στην διεύθυνση μνήμης 2323Η 
MVI A,33H	;Φόρτωμα του Α με 33Η τιμή
STA 2322H	;αποθήκευση του Α στην διεύθυνση μνήμης 2322Η 
JMP LABELEND 	;διακλάδωση στο LABEL_END
LABEL2:	STA 2323H	;αποθήκευση του Α στην διεύθυνση μνήμης 2323Η
MOV A,M	;μεταφορά δεδομένου από την [Η,L] μνήμη στον Α
STA 2322H	;αποθήκευση του Α στην διεύθυνση μνήμης 2322Η
LABELEND: HLT 